tests/nftArtilleryTests/netbankLoginAtrillery.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 60
      arrivalRate: 5
scenarios:
  - name: "GET /posts/1"
    flow:
      - get:
          url: "/posts/1"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - log: "GET /posts/1 completed"

  - name: "POST /posts"
    flow:
      - post:
          url: "/posts"
          json:
            title: "foo"
            body: "bar"
            userId: 1
          expect:
            - statusCode: 201
            - contentType: "application/json"
      - log: "POST /posts completed"